import React from "react";
import { QAContent, QAStyleContainer, SParagraphLeft,SParagraphRight,SHeading,ParagraphContainer, QAIsland } from "./styled";

function ManualTestingPage() {
  return (
    <QAStyleContainer>
      <QAContent>
  
        <QAIsland>
      
            <ParagraphContainer>
            <SParagraphLeft>
            Внешне вомбат напоминает медвежонка или очень крупного хомяка. По строению тела и отдельных деталей организма он имеет много общего с коалой, но в действительности их родство достаточно отдалённое.

Длина тела вомбата — от 70 до 130 см, вес — от 20 до 45 кг. Самым крупным из ныне живущих является широколобый вомбат. Среди вымерших вомбатовых были виды, значительно превосходившие по размерам современных представителей семейства. Так, живший в плейстоцене Phascolonus gigas весил около 200 кг[6].

Туловище толстое, устроено компактно. Голова большая, производит впечатление слегка расплющенной с боков, глаза маленькие, уши округлые, небольшие, прижаты к голове. Нос у обыкновенного вомбата — голый, у остальных видов — волосатый. Хвост короткий. Конечности короткие и сильные, на каждой из них пять пальцев, из которых внешние четыре увенчаны большими когтями, приспособленными для копания земли. Шерсть тёмная, серых или коричневых оттенков, в зависимости от вида.

Челюсти и зубы вомбатовых проявляют сходство с грызунами. В верхнем и нижнем ряду у вомбатов имеется по паре передних режущих зубов. Жевательные зубы построены весьма просто, угловые зубы отсутствуют. У вомбатовых наименьшее количество зубов среди сумчатых — 12.

У вомбатов острый слух и обоняние, но довольно слабое зрение. Несмотря на внешнюю неуклюжесть, они очень быстрые: спасаясь от опасности, вомбат может легко влезть на дерево, нырнуть в водоём или убежать. Могут бежать со скоростью до 40 км/ч, а на коротких дистанциях достигают скорости в 60 км/ч
            </SParagraphLeft>
             <SParagraphRight>
             Млекопита́ющие (лат. Mammalia) — класс позвоночных животных, основной отличительной особенностью которых является вскармливание детёнышей молоком[1]. Класс входит в кладу синапсид надкласса четвероногих и представляет собой самую прогрессивную группу позвоночных[2]. По подсчётам биологов, известно более 6500 современных видов млекопитающих[3], среди которых и вид Человек разумный (лат. Homo sapiens); общее же число видов млекопитающих, включая вымершие, превышает 20 000[4].

Млекопитающие распространены почти повсеместноПерейти к разделу «#Распространение». Произошли от высокоразвитых синапсид в конце триасаПерейти к разделу «#Происхождение». К млекопитающим относят ныне живущих однопроходных, сумчатых и плацентарных, а также большое число вымерших групп. Современные виды, входящие в класс млекопитающих, объединяют в 26—29 отрядовПерейти к разделу «#Классификация».

Внешний вид млекопитающих весьма разнообразен, но в целом соответствует характерному и для других четвероногих плану строенияПерейти к разделу «#Внешний вид». Анатомия и физиология млекопитающих характеризуется наличием тех же функциональных систем, что и у прочих четвероногих. Однако многие из этих систем достигли высокого уровня развития, так что данный класс среди позвоночных считают наиболее высокоорганизованнымПерейти к разделу «#Анатомия и физиология». Приспособления млекопитающих к жизни в различных средах обитания весьма разнообразны, их поведение отличается сложностью и многообразиемПерейти к разделу «#Образ жизни». Они занимают доминирующие позиции среди наземной фауны (в водной среде они уступают лишь лучепёрым рыбам). Млекопитающие играют большую роль в жизни и хозяйственной деятельности человека: они выступают как важные источники продуктов питания и производственного сырья, выполняют транспортные функции, служат тягловой силой, используются как лабораторные животные и домашние питомцыПерейти к разделу «#Практическое значение».
             </SParagraphRight>
             </ParagraphContainer>
        </QAIsland>
      </QAContent>
    </QAStyleContainer>
  );
}

export default ManualTestingPage;
